ext_alsav/DataProcessors/алсав_ВыгрузкаФайла_HOFF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсав_ВыгрузкаФайла_HOFF</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикОтгрузкиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоНеобеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностиКомплектацииПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоПолуфабрикат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантКомлектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/DataProcessors/алсав_ВыгрузкаФайла_HOFF/Ext/ManagerModule.bsl
Функция ПодготовитьИОтправитьJSON()ЭКСПОРТ  
	//данные = ПолучитьДанные();
	данные = ПолучитьДанныеОтправки();
	json = алсав_ВыгрузкаCsvJson.СтруктураВjson(данные);
	ОтправитьДанные(json);
КонецФункции

Функция ОтправитьДанные(данные)
	//https://prod-vendremains.hoff.ru/VendInventoryReader/
	
	хост = "prod-vendremains.hoff.ru";
	
	Соединение = Новый HTTPСоединение(хост,,,,,,Истина);
	
	ЗаголовокHTTP = новый Соответствие;
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	
	HTTPЗапрос = Новый HTTPЗапрос("/VendInventoryReader/", ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(данные);
    Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Сообщить("Код ответа:" + Результат.КодСостояния);
	Сообщить("Тело ответа:" + Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
КонецФункции	

Функция ПолучитьДанныеОтправки()
	резалт = новый Структура();
	резалт.Вставить("supplierId", "80003299");
	резалт.Вставить("dateTime", ТекущаяДата());  
	
	warehouses = новый Массив();
	резалт.Вставить("warehouses", warehouses);     
	
	
	
	warehous = Новый Структура; 
	
	warehouses.Добавить(warehous);
	
	warehous.Вставить("warehouseId", 80003299);
	
	items = новый Массив();
	warehous.Вставить("items", items);
	
	
	////////////////////////////////////////////////////////////////////
	Запрос = ПолучитьЗапрос();	
	////////////////////////////////////////////////////////////////////
	
	рез = запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл		
		стрАртикул = СокрЛП(Строка(рез.Артикул));
		Если ЗначениеЗаполнено(стрАртикул) и (рез.Остаток > 0) Тогда
			item = новый Структура("itemId, quantity", стрАртикул, рез.Остаток); 
			items.Добавить(item);
		КонецЕсли;
	КонецЦикла;
	
	Возврат резалт;
КонецФункции 

Функция ПолучитьТекстЗапроса_ХОФФ()
	возврат "   ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДС_ХОФФ.Значение КАК Артикул,
				|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) КАК Остаток
				|ИЗ
				|	(ВЫБРАТЬ
				|		Таблица.Номенклатура КАК Номенклатура,
				|		Таблица.Характеристика КАК Характеристика,
				|		Таблица.Склад КАК Склад,
				|		Таблица.ВНаличии КАК ВНаличии,
				|		0 КАК ПриходОсновной,
				|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
				|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
				|		0 КАК ВРезервеГрафика,
				|		Таблица.КОтгрузке КАК КОтгрузке,
				|		Таблица.КОбеспечению КАК КОбеспечению,
				|		Таблица.КОбеспечениюИзСборок КАК КОбеспечениюИзСборок
				|	ИЗ
				|		(ВЫБРАТЬ
				|			Набор.Номенклатура КАК Номенклатура,
				|			Набор.Характеристика КАК Характеристика,
				|			Набор.Склад КАК Склад,
				|			СУММА(Набор.ВНаличии) КАК ВНаличии,
				|			СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
				|			СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
				|			СУММА(Набор.КОтгрузке) КАК КОтгрузке,
				|			СУММА(Набор.КОбеспечению) КАК КОбеспечению,
				|			СУММА(Набор.КОбеспечениюИзСборок) КАК КОбеспечениюИзСборок
				|		ИЗ
				|			(ВЫБРАТЬ
				|				Таблица.Номенклатура КАК Номенклатура,
				|				Таблица.Характеристика КАК Характеристика,
				|				Таблица.Склад КАК Склад,
				|				Таблица.ВНаличииОстаток КАК ВНаличии,
				|				Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
				|				Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
				|				0 КАК КОтгрузке,
				|				0 КАК КОбеспечению,
				|				0 КАК КОбеспечениюИзСборок
				|			ИЗ
				|				РегистрНакопления.СвободныеОстатки.Остатки(, {((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад,
				|				Таблица.КОтгрузкеОстаток,
				|				0,
				|				0,
				|				Таблица.КОтгрузкеОстаток,
				|				0 КАК КОбеспечению,
				|				0 КАК КОбеспечениюИзСборок
				|			ИЗ
				|				РегистрНакопления.ТоварыКОтгрузке.Остатки(, {((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Склад).*, (Номенклатура).*, (Характеристика).*}) КАК Таблица
				|						        
				|						        
				|						        
				|						        
				|						        
				|			ОБЪЕДИНИТЬ ВСЕ  
				|			
				|			ВЫБРАТЬ
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад,
				|				0,
				|				0,
				|				0,
				|				0,
				|				SUM(Таблица.КоличествоНеобеспечено) КАК КОбеспечению,
				|				0
				|			ИЗ
				|				РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица
				|			{WHERE ((Номенклатура, Характеристика) В
				|						    (ВЫБРАТЬ
				|						        ТаблицаОтбора.Номенклатура КАК Номенклатура,
				|						        ТаблицаОтбора.Характеристика КАК Характеристика
				|						    ИЗ
				|						        ОтборПоСегментуНоменклатуры КАК ТаблицаОтбора
				|						    ГДЕ
				|						        ТаблицаОтбора.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)), (Склад).*, (Номенклатура).*, (Характеристика).*} 
				|			GROUP BY 
				|				Таблица.Номенклатура,
				|				Таблица.Характеристика,
				|				Таблица.Склад
				|			HAVING 
				|				SUM(Таблица.КоличествоНеобеспечено) > 0 
				|				
				|			
				|			ОБЪЕДИНИТЬ ВСЕ  
				|			                    
				|			                    
				|					                    
				|			ВЫБРАТЬ
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад,
				|				0,
				|				0,
				|				0,
				|				0,
				|				0,
				|				SUM(ВТ_ВариантыКомплектацииНоменклатуры.Количество * Таблица.КоличествоНеобеспечено) КАК КОбеспечениюИзСборок
				|			ИЗ
				|			(
				|				ВЫБРАТЬ
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад,
				|					SUM(Таблица.КоличествоНеобеспечено) КАК КоличествоНеобеспечено
				|					
				|				ИЗ
				|					РегистрНакопления.ГрафикОтгрузкиТоваров AS Таблица 
				|				GROUP BY 
				|					Таблица.Номенклатура,
				|					Таблица.Характеристика,
				|					Таблица.Склад
				|				HAVING 
				|					SUM(Таблица.КоличествоНеобеспечено) > 0
				|			)Таблица
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
				|				ВЫБРАТЬ
				|					ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Владелец КАК НоменклатураОсновногоКомпонента,
				|					ВариантыКомплектацииНоменклатуры.Ссылка.Характеристика КАК ХарактеристикаОсновногоКомпонента,
				
				|					ЕСТЬNULL(Полуфабрикаты.Номенклатура, ВариантыКомплектацииНоменклатуры.Номенклатура) КАК Номенклатура,
				|					ЕСТЬNULL(Полуфабрикаты.Характеристика, ВариантыКомплектацииНоменклатуры.Характеристика) КАК Характеристика,
				|					ЕСТЬNULL(Полуфабрикаты.Количество, 1) * ВариантыКомплектацииНоменклатуры.Количество КАК Количество,
				|					ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
				|				ИЗ
				|					Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатуры
				|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Полуфабрикаты
				|						ПО (ВариантыКомплектацииНоменклатуры.ЭтоПолуфабрикат = ИСТИНА)
				|							И ВариантыКомплектацииНоменклатуры.ВариантКомлектации = Полуфабрикаты.Ссылка
				|							И Полуфабрикаты.Ссылка.ПометкаУдаления = ЛОЖЬ
				|							И Полуфабрикаты.Ссылка.Основной
				|					ГДЕ ВариантыКомплектацииНоменклатуры.Ссылка.ПометкаУдаления = ЛОЖЬ И ВариантыКомплектацииНоменклатуры.Ссылка.Основной
				|			) КАК ВТ_ВариантыКомплектацииНоменклатуры
				|				ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Таблица.Номенклатура)
				|					И (ВТ_ВариантыКомплектацииНоменклатуры.Характеристика IS NULL OR ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Таблица.Характеристика) 
				|					
				|			GROUP BY 
				|				ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура,
				|				ВТ_ВариантыКомплектацииНоменклатуры.Характеристика,
				|				Таблица.Склад
				|				        
				|						        
				|						        
				|		
				|		
				|		
				|		) КАК Набор
				|		
				|		СГРУППИРОВАТЬ ПО
				|			Набор.Номенклатура,
				|			Набор.Характеристика,
				|			Набор.Склад) КАК Таблица) КАК Набор
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДС_Серия
				|		ПО (ДС_Серия.Ссылка = Набор.Номенклатура)
				|			И (ДС_Серия.Свойство.Заголовок = ""Серия"")
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ХОФФ
				|		ПО (ДС_ХОФФ.Ссылка = Набор.Характеристика)
				|			И (ДС_ХОФФ.Свойство.Заголовок = ""Артикул HOFF"")
				|
				|ГДЕ Набор.Склад.Наименование = ""Склад адресного хранения""
				|
				|СГРУППИРОВАТЬ ПО
				|	Набор.Характеристика,
				|	ДС_ХОФФ.Значение
				|HAVING 
				|	СУММА(Набор.ВНаличии) - (СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика)) - СУММА(Набор.КОбеспечению) - СУММА(Набор.КОбеспечениюИзСборок) > 0";	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
///////////////////                      V2 json,csv                /////////////////////     
/////////////////////////////////////////////////////////////////////////////////////////


Функция ПолучитьСхемуКомпановкиДанных()
	возврат ПолучитьМакет("ЗапросДляВыгрузки");
КонецФункции

Функция ВыполнитьВыгрузку() ЭКСПОРТ 
	
	мДанные = ПолучитьДанныеДляФайловНаFTP();
	контент = алсав_ВыгрузкаCsvJson.МассивСтруктурВCSV(мДанные);
	
	имяФайла = "alsav_hoff";
	
	// Получаем данные для FTP из безопасного хранилища
	СерверFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_ftp");
	ЛогинFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_login");
	ПарольFTP = алсав_ВыгрузкаCsvJson.ПолучитьСекрет("secret_alsav_csv_password");
	
	ФТПСоединение = Новый FTPСоединение(СерверFTP, 21, ЛогинFTP, ПарольFTP);
	ВременныйФайл = ПолучитьИмяВременногоФайла( "txt");
	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".csv"); 
	УдалитьФайлы(ВременныйФайл);  
	
	контент_json = алсав_ВыгрузкаCsvJson.СтруктураВjson(мДанные);
	ВременныйФайл = ПолучитьИмяВременногоФайла("json");	
	ТекстовыйДок = новый ТекстовыйДокумент();
	ТекстовыйДок.УстановитьТекст(контент_json);
	ТекстовыйДок.Записать(ВременныйФайл);	
	ФТПСоединение.Записать(ВременныйФайл,""+имяФайла+".json"); 	
	УдалитьФайлы(ВременныйФайл);   
КонецФункции


Функция ПолучиьтТекстЗапроса()
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпановкиДанных(); 
	Если ЛОЖЬ Тогда СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных; КонецЕсли;
	запрос = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	возврат запрос;;
КонецФункции 


Функция ПолучитьДанныеДляФайловНаFTP()
	
	
	данные = новый Массив;
	поляШаблон = "Артикул,Остаток";
	
	////////////////////////////////////////////////////////////////////
	Запрос = ПолучитьЗапрос();	
	////////////////////////////////////////////////////////////////////
	
	дт1 = ТекущаяДата();
	рез = Запрос.Выполнить().Выбрать();
	дт2 = ТекущаяДата();
	
	Пока Рез.Следующий() Цикл
		нСтр = Новый Структура(поляШаблон);
		
		ЗаполнитьЗначенияСвойств(нСтр, Рез);
		
		Если нСтр.Остаток < 0 Тогда
			нСтр.Остаток = 0;
		КонецЕсли;
		нСтр = алсав_ВыгрузкаCsvJson.СтруктураПреобразоватьЗначенияВСериализуеммыеТипы(нСтр);
		
		данные.Добавить(нСтр);
	КонецЦикла;
	Возврат данные;
КонецФункции  


Функция ПолучитьЗапрос()    
	//  e1cib/data/Справочник.ВариантыОтчетов?ref=9de90242ac11000411f05d98b2ef5d18
	////////////////////////////////////////////////////////////////////
	запросТекст = ПолучиьтТекстЗапроса();
	
	Запрос = Новый Запрос(запросТекст);       
	
	////// базовые параметры
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВидЦены",Справочники.ВидыЦен.НайтиПоНаименованию("Отпускная цена (с учетом НДС)")); 
	Запрос.УстановитьПараметр("ПроцентОплаты",1);
	
	
	////// дополнительные параметры
	группыНоманклатуры = Новый Массив;
	группыНоманклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("1.1 Продукция стандартная"));
	                                                                                                           	
	
	группыНоманклатурыИсключения = Новый Массив;
	группыНоманклатурыИсключения.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("3 ""ЭКОНОМ"""));
	
	Запрос.УстановитьПараметр("группыНоманклатуры",группыНоманклатуры);
	Запрос.УстановитьПараметр("группыНоманклатурыИсключения",группыНоманклатурыИсключения); 
	

	Запрос.Текст 
	= "ВЫБРАТЬ
	|	ДС_ХОФФ.Значение КАК Артикул
	| , MIN(ВозможностьСобрать) Остаток
	| ИЗ (" + Запрос.Текст + "
	| ) КАК Т                                                                
	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДС_ХОФФ
	|		ПО (ДС_ХОФФ.Ссылка = ПродуктХарактеристика)
	|			И (ДС_ХОФФ.Свойство.Заголовок = ""Артикул HOFF"")

	| WHERE Т.ПродуктНоменклатура В ИЕРАРХИИ (&группыНоманклатуры) И Т.ПродуктНоменклатура НЕ В ИЕРАРХИИ (&группыНоманклатурыИсключения)
	| GROUP BY ПродуктХарактеристика, ДС_ХОФФ.Значение
	| HAVING MIN(ВозможностьСобрать) >= 1
	| //ORDER BY Т.Серия";
	
	Возврат Запрос;
КонецФункции


КонецФункции
